Project/Toir/src/Reports/торо_ИсторияОстановаЗапускаОборудования/торо_ИсторияОстановаЗапускаОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>торо_ИсторияОстановаЗапускаОборудования</name>
</mdclass:Report>

Project/Toir/src/AccumulationRegisters/торо_ОстановленноеОборудование/торо_ОстановленноеОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_ОстановленноеОборудование</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПростоя</name>
    <type>
      <types>CatalogRef.торо_ПричиныПростояОборудования</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Project/Toir/src/AccumulationRegisters/торо_ВремяПростояОборудования/торо_ВремяПростояОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_ВремяПростояОборудования</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ВремяПростоя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаПростоя</name>
    <type>
      <types>CatalogRef.торо_ПричиныПростояОборудования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Project/Toir/src/Catalogs/торо_СтруктурыОР/торо_СтруктурыОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_СтруктурыОР</name>
  <predefined>
    <items>
      <name>ОсновнаяИерархия</name>
      <description>Основная иерархия</description>
    </items>
    <items>
      <name>СтруктураПоМестонахождению</name>
      <description>Структура по местонахождению</description>
    </items>
    <items>
      <name>СтруктураПоТехнологическойПозиции</name>
      <description>Структура по технологической позиции</description>
    </items>
  </predefined>
  <attributes>
    <name>ИзменяетсяДокументами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенВводНовыхОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтроитсяАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРеквизитаОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечныеЭлементыВДереве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Reports/торо_ИсторияОстановаЗапускаОборудования/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Идентификатор = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИерархияТип")).ИдентификаторПользовательскойНастройки;
	СтрокаПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
	
	Если СтрокаПараметр <> Неопределено И ЗначениеЗаполнено(СтрокаПараметр.Значение) Тогда
		ТекИерархия = СтрокаПараметр.Значение;
	Иначе
		ТекИерархия = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнаяСтруктураИерархии",
			Справочники.торо_СтруктурыОР.ПустаяСсылка());
			
		Если СтрокаПараметр <> Неопределено Тогда
			СтрокаПараметр.Значение = ТекИерархия;
		КонецЕсли;
		
	КонецЕсли;
	
	торо_ОтчетыСервер.УстановитьЗапросыНаборовДанныхИерархииОР(СхемаКомпоновкиДанных, ТекИерархия, "КонецПериода");
	
	Если ТекИерархия.СтроитсяАвтоматически Тогда
				
		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос =
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ
		|	ВТ_Данные.Регистратор КАК Регистратор,
		|	ВТ_Данные.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_Данные.ПричинаПростоя КАК ПричинаПростоя,
		|	ВТ_Данные.Остановлено КАК Остановлено,
		|	ВТ_Данные.Запущено КАК Запущено,
		|	ВТ_Данные.ВидОперации КАК ВидОперации,
		|	ВТ_Данные.РемонтныхЕдениц КАК РемонтныхЕдениц,
		|	ВТ_Данные.ВремяПростояСекунды КАК ВремяПростояСекунды,
		|	ВТ_Данные.Период КАК Период,
		|	ВТ_Данные.Порядок КАК Порядок,
		|	ВТ_Данные.ОбъектРемонта." + ТекИерархия.РеквизитОР + " КАК ОбъектИерархии
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные";

		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.Иерархия);
		
	Иначе

		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.ТолькоИерархия);

		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос = 
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ
		|	ВТ_Данные.Регистратор КАК Регистратор,
		|	ВТ_Данные.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_Данные.ПричинаПростоя КАК ПричинаПростоя,
		|	ВТ_Данные.Остановлено КАК Остановлено,
		|	ВТ_Данные.Запущено КАК Запущено,
		|	ВТ_Данные.ВидОперации КАК ВидОперации,
		|	ВТ_Данные.РемонтныхЕдениц КАК РемонтныхЕдениц,
		|	ВТ_Данные.ВремяПростояСекунды КАК ВремяПростояСекунды,
		|	ВТ_Данные.Период КАК Период,
		|	ВТ_Данные.Порядок КАК Порядок,
		|	ВТ_Данные.ОбъектРемонта КАК ОбъектИерархии
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСодержательнуюЧастьЗапроса() 
	
	ЗапросТекст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ОстановленноеОборудование.Регистратор КАК Регистратор,
	|	торо_ОстановленноеОборудование.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ОстановленноеОборудование.ПричинаПростоя КАК ПричинаПростоя,
	|	ВЫБОР
	|		КОГДА торо_ОстановленноеОборудование.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА торо_ОстановленноеОборудование.Период
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК Запущено,
	|	ВЫБОР
	|		КОГДА торо_ОстановленноеОборудование.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА торо_ОстановленноеОборудование.Период
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК Остановлено,
	|	торо_ОстановленноеОборудование.Регистратор.ВидОперации КАК ВидОперации,
	|	торо_ОстановленноеОборудование.ОбъектРемонта КАК РемонтныхЕдениц,
	|	торо_ВремяПростояОборудования.ВремяПростоя КАК ВремяПростояСекунды,
	|	торо_ОстановленноеОборудование.Период КАК Период
	|ПОМЕСТИТЬ ТабОстановов
	|ИЗ
	|	РегистрНакопления.торо_ОстановленноеОборудование КАК торо_ОстановленноеОборудование
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ВремяПростояОборудования КАК торо_ВремяПростояОборудования
	|		ПО (ВЫБОР
	|				КОГДА торо_ОстановленноеОборудование.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА торо_ОстановленноеОборудование.Период = торо_ВремяПростояОборудования.Период
	|				ИНАЧЕ торо_ОстановленноеОборудование.Период = торо_ВремяПростояОборудования.ДатаЗапуска
	|			КОНЕЦ)
	|			И торо_ОстановленноеОборудование.Регистратор = торо_ВремяПростояОборудования.Регистратор
	|			И торо_ОстановленноеОборудование.ОбъектРемонта = торо_ВремяПростояОборудования.ОбъектРемонта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|		ПО торо_ОстановленноеОборудование.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
	|ГДЕ
	|	(&НачалоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ торо_ОстановленноеОборудование.Период >= &НачалоПериода)
	|	И (&КонецПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ торо_ОстановленноеОборудование.Период <= &КонецПериода)
	|	И НЕ торо_ОстановленноеОборудование.Регистратор.ВидОперации ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабОстановов.Регистратор КАК Регистратор,
	|	ТабОстановов.ОбъектРемонта КАК ОбъектРемонта,
	|	ТабОстановов.ПричинаПростоя КАК ПричинаПростоя,
	|	ТабОстановов.Запущено КАК Запущено,
	|	ТабОстановов.Остановлено КАК Остановлено,
	|	ТабОстановов.ВидОперации КАК ВидОперации,
	|	ТабОстановов.РемонтныхЕдениц КАК РемонтныхЕдениц,
	|	ТабОстановов.ВремяПростояСекунды КАК ВремяПростояСекунды,
	|	ТабОстановов.Период КАК Период,
	|	1 КАК Порядок
	|ПОМЕСТИТЬ ТаблицаИспытанийНачало
	|ИЗ
	|	ТабОстановов КАК ТабОстановов
	|ГДЕ
	|	НЕ ТабОстановов.Остановлено = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабОстановов.Регистратор КАК Регистратор,
	|	ТабОстановов.ОбъектРемонта КАК ОбъектРемонта,
	|	ТабОстановов.ПричинаПростоя КАК ПричинаПростоя,
	|	ТабОстановов.Запущено КАК Запущено,
	|	ТабОстановов.Остановлено КАК Остановлено,
	|	ТабОстановов.ВидОперации КАК ВидОперации,
	|	ТабОстановов.РемонтныхЕдениц КАК РемонтныхЕдениц,
	|	ТабОстановов.ВремяПростояСекунды КАК ВремяПростояСекунды,
	|	ТабОстановов.Период КАК Период,
	|	0 КАК Порядок
	|ПОМЕСТИТЬ ТаблицаИспытанийКонец
	|ИЗ
	|	ТабОстановов КАК ТабОстановов
	|ГДЕ
	|	НЕ ТабОстановов.Запущено = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаИспытанийНачало.Регистратор КАК Регистратор,
	|	ТаблицаИспытанийНачало.ОбъектРемонта КАК ОбъектРемонта,
	|	ТаблицаИспытанийНачало.ПричинаПростоя КАК ПричинаПростоя,
	|	ТаблицаИспытанийНачало.Остановлено КАК Остановлено,
	|	ТаблицаИспытанийНачало.ВидОперации КАК ВидОперации,
	|	ТаблицаИспытанийНачало.РемонтныхЕдениц КАК РемонтныхЕдениц,
	|	ТаблицаИспытанийНачало.ВремяПростояСекунды КАК ВремяПростояСекунды,
	|	МИНИМУМ(ТаблицаИспытанийКонец.Запущено) КАК Запущено,
	|	ТаблицаИспытанийНачало.Период КАК Период,
	|	ТаблицаИспытанийНачало.Порядок КАК Порядок
	|ПОМЕСТИТЬ ТаблицаИспытанийДатаОкончания
	|ИЗ
	|	ТаблицаИспытанийНачало КАК ТаблицаИспытанийНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИспытанийКонец КАК ТаблицаИспытанийКонец
	|		ПО ТаблицаИспытанийНачало.ОбъектРемонта = ТаблицаИспытанийКонец.ОбъектРемонта
	|			И ТаблицаИспытанийНачало.Остановлено < ТаблицаИспытанийКонец.Запущено
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИспытанийНачало.ОбъектРемонта,
	|	ТаблицаИспытанийНачало.ПричинаПростоя,
	|	ТаблицаИспытанийНачало.Регистратор,
	|	ТаблицаИспытанийНачало.Остановлено,
	|	ТаблицаИспытанийНачало.ВидОперации,
	|	ТаблицаИспытанийНачало.РемонтныхЕдениц,
	|	ТаблицаИспытанийНачало.ВремяПростояСекунды,
	|	ТаблицаИспытанийНачало.Период,
	|	ТаблицаИспытанийНачало.Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТаблицаИспытанийДатаОкончания.Регистратор, ТаблицаИспытанийКонец.Регистратор) КАК Регистратор,
	|	ЕСТЬNULL(ТаблицаИспытанийДатаОкончания.ОбъектРемонта, ТаблицаИспытанийКонец.ОбъектРемонта) КАК ОбъектРемонта,
	|	ЕСТЬNULL(ТаблицаИспытанийДатаОкончания.ПричинаПростоя, ТаблицаИспытанийКонец.ПричинаПростоя) КАК ПричинаПростоя,
	|	ТаблицаИспытанийДатаОкончания.Остановлено КАК Остановлено,
	|	ТаблицаИспытанийКонец.Запущено КАК Запущено,
	|	ЕСТЬNULL(ТаблицаИспытанийДатаОкончания.ВидОперации, ТаблицаИспытанийКонец.ВидОперации) КАК ВидОперации,
	|	ЕСТЬNULL(ТаблицаИспытанийДатаОкончания.РемонтныхЕдениц, ТаблицаИспытанийКонец.РемонтныхЕдениц) КАК РемонтныхЕдениц,
	|	ЕСТЬNULL(ТаблицаИспытанийДатаОкончания.ВремяПростояСекунды, ТаблицаИспытанийКонец.ВремяПростояСекунды) КАК ВремяПростояСекунды,
	|	ЕСТЬNULL(ТаблицаИспытанийДатаОкончания.Период, ТаблицаИспытанийКонец.Период) КАК Период,
	|	ЕСТЬNULL(ТаблицаИспытанийДатаОкончания.Порядок, ТаблицаИспытанийКонец.Порядок) КАК Порядок
	|ПОМЕСТИТЬ ТаблицаБезПричинЗапуска
	|ИЗ
	|	ТаблицаИспытанийДатаОкончания КАК ТаблицаИспытанийДатаОкончания
	|		ПОЛНОЕ СОЕДИНЕНИЕ ТаблицаИспытанийКонец КАК ТаблицаИспытанийКонец
	|		ПО ТаблицаИспытанийДатаОкончания.ОбъектРемонта = ТаблицаИспытанийКонец.ОбъектРемонта
	|			И ТаблицаИспытанийДатаОкончания.Запущено = ТаблицаИспытанийКонец.Запущено
	|			И ТаблицаИспытанийДатаОкончания.Регистратор = ТаблицаИспытанийКонец.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаБезПричинЗапуска.Регистратор КАК Регистратор,
	|	ТаблицаБезПричинЗапуска.ОбъектРемонта КАК ОбъектРемонта,
	|	ВЫБОР
	|		КОГДА ТаблицаБезПричинЗапуска.Запущено = ТаблицаИспытанийДатаОкончания.Запущено
	|			ТОГДА ТаблицаИспытанийДатаОкончания.ПричинаПростоя
	|		ИНАЧЕ ТаблицаБезПричинЗапуска.ПричинаПростоя
	|	КОНЕЦ КАК ПричинаПростоя,
	|	ТаблицаБезПричинЗапуска.Остановлено КАК Остановлено,
	|	ТаблицаБезПричинЗапуска.Запущено КАК Запущено,
	|	ТаблицаБезПричинЗапуска.ВидОперации КАК ВидОперации,
	|	ТаблицаБезПричинЗапуска.РемонтныхЕдениц КАК РемонтныхЕдениц,
	|	ТаблицаБезПричинЗапуска.ВремяПростояСекунды КАК ВремяПростояСекунды,
	|	ТаблицаБезПричинЗапуска.Период КАК Период,
	|	ТаблицаБезПричинЗапуска.Порядок КАК Порядок
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	ТаблицаБезПричинЗапуска КАК ТаблицаБезПричинЗапуска
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИспытанийДатаОкончания КАК ТаблицаИспытанийДатаОкончания
	|		ПО ТаблицаБезПричинЗапуска.ОбъектРемонта = ТаблицаИспытанийДатаОкончания.ОбъектРемонта
	|			И (ТаблицаИспытанийДатаОкончания.Запущено = ТаблицаБезПричинЗапуска.Запущено)"
		
	+ "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Возврат ЗапросТекст;
	
КонецФункции

#КонецОбласти
